In [1]:
import pandas as pd

#Reading csv files
df_1 = pd.read_csv("Active Grandmasters.csv")
df_2 = pd.read_csv("Active International Masters.csv")
df_3 = pd.read_csv("Active Candidate Masters.csv")

# Concatenate the DataFrames
df = pd.concat([df_1, df_2, df_3], ignore_index=True)

df.head()

,Name,Title,Country,Standard Rating,Rapid Rating,Blitz Rating,Birth Year
0,"Carlsen, Magnus",GM,NOR,2829.0,2818.0,2887.0,1990.0
1,"Caruana, Fabiano",GM,USA,2795.0,2765.0,2813.0,1992.0
2,"Ding, Liren",GM,CHN,2780.0,2830.0,2787.0,1992.0
3,"Nakamura, Hikaru",GM,USA,2778.0,2731.0,2874.0,1987.0
4,"Firouzja, Alireza",GM,FRA,2777.0,2742.0,2896.0,2003.0

In [2]:
#checking info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5007 entries, 0 to 5006
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             4999 non-null   object
 1   Title            4999 non-null   object
 2   Country          4999 non-null   object
 3   Standard Rating  4999 non-null   float64
 4   Rapid Rating     4325 non-null   float64
 5   Blitz Rating     4329 non-null   float64
 6   Birth Year       4999 non-null   float64
dtypes: float64(4), object(3)
memory usage: 273.9+ KB

In [3]:
#checking null values
df.isnull().sum()

Name                 8
Title                8
Country              8
Standard Rating      8
Rapid Rating       682
Blitz Rating       678
Birth Year           8
dtype: int64

In [4]:
#checking rows that contains null values
df[df['Name'].isnull()]

,Name,Title,Country,Standard Rating,Rapid Rating,Blitz Rating,Birth Year
4999,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5001,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5002,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5003,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5004,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5005,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5006,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
# Drop rows with missing 'Name' values
df = df.dropna(subset=['Name'])

df.isnull().sum()

Name                 0
Title                0
Country              0
Standard Rating      0
Rapid Rating       674
Blitz Rating       670
Birth Year           0
dtype: int64

Adding 'Age' Column

In [7]:
# Assume the current year is 2023
current_year = 2023
# Calculate age and create a new 'Age' column
df['Age'] = current_year - df['Birth Year']
df.head(2)

,Name,Title,Country,Standard Rating,Rapid Rating,Blitz Rating,Birth Year,Age
0,"Carlsen, Magnus",GM,NOR,2829.0,2818.0,2887.0,1990.0,33.0
1,"Caruana, Fabiano",GM,USA,2795.0,2765.0,2813.0,1992.0,31.0

In [9]:
#checking statistical summary
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Standard Rating,4999.0,2292.383077,213.007134,1357.0,2169.0,2337.0,2437.0,2829.0
Rapid Rating,4325.0,2275.004855,216.680287,1269.0,2145.0,2318.0,2422.0,2830.0
Blitz Rating,4329.0,2270.340032,219.755359,1280.0,2137.0,2309.0,2420.0,2896.0
Birth Year,4999.0,1981.179036,51.213913,0.0,1970.0,1984.0,1996.0,2014.0
Age,4999.0,41.820964,51.213913,9.0,27.0,39.0,53.0,2023.0

In [19]:
# dropping unrealistic age
df_cleaned = df[df['Age'] <= 100]

df_cleaned.describe().T

,count,mean,std,min,25%,50%,75%,max
Standard Rating,4996.0,2292.435949,213.050117,1357.0,2169.00,2337.0,2437.0,2829.0
Rapid Rating,4322.0,2275.063165,216.742231,1269.0,2144.25,2319.0,2422.0,2830.0
Blitz Rating,4327.0,2270.315692,219.803028,1280.0,2137.00,2309.0,2420.0,2896.0
Birth Year,4996.0,1982.368695,16.298006,1931.0,1970.00,1984.0,1996.0,2014.0
Age,4996.0,40.631305,16.298006,9.0,27.00,39.0,53.0,92.0

In [13]:
#checking unique values of the title column
df_cleaned.Title.value_counts()

Title
IM        2204
CM        1376
GM        1282
IM WGM      97
GM WGM      29
CM WFM       5
IM WIM       1
CM WCM       1
CM WIM       1
Name: count, dtype: int64

In [14]:
# Manipulating title column

df_cleaned['Title'] = df_cleaned['Title'].replace({'GM WGM': 'GM', 'IM WGM': 'IM', 'CM WFM': 'CM', 'IM WIM': 'IM', 'CM WCM': 'CM', 'CM WIM': 'CM'})

In [15]:
df_cleaned.Title.value_counts()

Title
IM    2302
CM    1383
GM    1311
Name: count, dtype: int64

In [17]:
df_cleaned.shape

(4996, 8)

In [16]:
# Specify the name of the CSV file
output_file = "fide_active_players_2023.csv"

# Save the cleaned DataFrame to a CSV file
df.to_csv(output_file, index=False)

print(f"Data has been saved to {output_file}")

Data has been saved to fide_active_players_2023.csv